Revit 2026 API

# AnalysisDisplayStyleGetVectorSettings Method

---

Get vector settings object from the style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalysisDisplayVectorSettings GetVectorSettings()
```
```vb
Public Function GetVectorSettings As AnalysisDisplayVectorSettings
```
```cpp
public:
AnalysisDisplayVectorSettings^ GetVectorSettings()
```
```fsharp
member GetVectorSettings : unit -> AnalysisDisplayVectorSettings
```

#### Return Value

AnalysisDisplayVectorSettings

| Exception | Condition |
| --- | --- |
| InvalidOperationException | vector settings were not created with the object. |

#### Reference

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace